app/controllers/api/feeds_controller.rb

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 3]]
---
  def destroy
    @feed = Feed.find(params[:id])
    @feed.destroy